app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "author", "date") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "Sample Title"], ["body", "Sample body"], ["created_at", "2024-01-30 02:27:45.654354"], ["updated_at", "2024-01-30 02:27:45.654354"], ["author", nil], ["date", nil]]
---
  def create
    @article = Article.new(arti_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Updated Title"], ["updated_at", "2024-01-30 02:04:45.094279"], ["id", 980190963]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(arti_params)